artillery-load-test.yml
config:
  target: "http://localhost:4567"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Peak load"

scenarios:
  - name: "Browse forum"
    flow:
      - get:
          url: "/"
      - get:
          url: "/categories"
      - get:
          url: "/recent"
      - get:
          url: "/popular"